Rahix/avr-device/vendor/atmega64.atdf
      <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER">
        <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
        <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
        <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI">
      <register-group caption="Serial Peripheral Interface" name="SPI">
        <register caption="SPI Data Register" name="SPDR" offset="0x2F" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="SPI Status Register" name="SPSR" offset="0x2E" size="1" ocd-rw="R">
          <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
          <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
          <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
        </register>
        <register caption="SPI Control Register" name="SPCR" offset="0x2D" size="1">
          <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
          <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
          <bitfield caption="Data Order" mask="0x20" name="DORD"/>
          <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
          <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
          <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_SCK_RATE_3BIT">
        <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
        <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
        <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
        <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
        <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
        <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
        <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
        <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI Bit Rate register" name="TWBR" offset="0x70" size="1" mask="0xFF"/>
        <register caption="TWI Control Register" name="TWCR" offset="0x74" size="1" ocd-rw="R">
          <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
          <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
          <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
          <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
          <bitfield caption="TWI Write Collition Flag" mask="0x08" name="TWWC"/>
          <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
          <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
        </register>
        <register caption="TWI Status Register" name="TWSR" offset="0x71" size="1">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
          <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
        </register>
        <register caption="TWI Data register" name="TWDR" offset="0x73" size="1" mask="0xFF"/>
        <register caption="TWI (Slave) Address register" name="TWAR" offset="0x72" size="1">
          <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
          <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_TWI_PRESACLE">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="4" name="VAL_0x01" value="0x01"/>
        <value caption="16" name="VAL_0x02" value="0x02"/>
        <value caption="64" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART0">
        <register caption="USART I/O Data Register" name="UDR0" offset="0x2C" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSR0A" offset="0x2B" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC0"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC0"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE0"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE0"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR0"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE0"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X0"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM0"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR0B" offset="0x2A" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE0"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE0"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE0"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN0"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN0"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ02"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB80"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB80"/>
        </register>
