Rahix/avr-device/vendor/atmega64.atdf
        <register caption="USART Control and Status Register C" name="UCSR0C" offset="0x95" size="1">
          <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL0" values="COMM_USART_MODE"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM0" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS0" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ0"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL0"/>
        </register>
        <register caption="USART Baud Rate Register Hight Byte" name="UBRR0H" offset="0x90" size="1" mask="0x0F"/>
        <register caption="USART Baud Rate Register Low Byte" name="UBRR0L" offset="0x29" size="1" mask="0xFF"/>
      </register-group>
      <register-group caption="USART" name="USART1">
        <register caption="USART I/O Data Register" name="UDR1" offset="0x9C" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSR1A" offset="0x9B" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC1"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE1"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR1"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE1"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X1"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM1"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR1B" offset="0x9A" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ12"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB81"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB81"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSR1C" offset="0x9D" size="1">
          <bitfield caption="USART Mode Select" mask="0x40" name="UMSEL1" values="COMM_USART_MODE"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM1" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ1"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
        </register>
        <register caption="USART Baud Rate Register Hight Byte" name="UBRR1H" offset="0x98" size="1" mask="0x0F"/>
        <register caption="USART Baud Rate Register Low Byte" name="UBRR1L" offset="0x99" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="" name="COMM_USART_MODE">
        <value caption="Asynchronous Operation" name="VAL_0x00" value="0x00"/>
        <value caption="Synchronous Operation" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="VAL_0x00" value="0x00"/>
        <value caption="2-bit" name="VAL_0x01" value="0x01"/>
      </value-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="External SRAM Enable" mask="0x80" name="SRE"/>
          <bitfield caption="External SRAM Wait State Select" mask="0x40" name="SRW10"/>
          <bitfield caption="Sleep Enable" mask="0x20" name="SE"/>
          <bitfield caption="Sleep Mode Select" mask="0x18" name="SM"/>
          <bitfield caption="Sleep Mode Select" mask="0x04" name="SM2" values="CPU_SLEEP_MODE_2BITS1"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Control And Status Register" name="MCUCSR" offset="0x54" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="External Memory Control Register A" name="XMCRA" offset="0x6D" size="1">
          <bitfield caption="Wait state page limit" mask="0x70" name="SRL" values="CPU_SECTOR_LIMITS"/>
          <bitfield caption="Wait state select bit lower page" mask="0x0C" name="SRW0" values="CPU_WAIT_STATES"/>
          <bitfield caption="Wait state select bit upper page" mask="0x02" name="SRW11"/>
        </register>
        <register caption="External Memory Control Register B" name="XMCRB" offset="0x6C" size="1">
          <bitfield caption="External Memory Bus Keeper Enable" mask="0x80" name="XMBK"/>
          <bitfield caption="External Memory High Mask" mask="0x07" name="XMM"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x6F" size="1" mask="0xFF">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
